---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.Dispose
source: html/93a1db73-1fe2-9ac8-e85d-424efb6e5152.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.Dispose Method

Releases all resources used by the RebarHostData

## Syntax (C#)
```csharp
public void Dispose()
```